(function ($, UIK) {
    $.extend(UIK.viewmodel, {

    });
    $.extend(UIK.view, {

    });
    UIK.regions = {};

    UIK.regions.colorMap = {
        'Мосрентген': '#0000CD',
        'Академический': '#0000FF',
        'Алексеевский': '#006400',
        'Алтуфьевский': '#008000',
        'Арбат': '#008080',
        'Аэропорт': '#008B8B',
        'Бабушкинский': '#00BFFF',
        'Басманный': '#00CED1',
        'Беговой': '#00FA9A',
        'Бескудниковский': '#00FF00',
        'Бибирево': '#00FFFF',
        'Бирюлево Восточное': '#00FFFF',
        'Бирюлево Западное': '#191970',
        'Богородское': '#1E90FF',
        'Братеево': '#20B2AA',
        'Бутырский': '#228B22',
        'Вешняки': '#2E8B57',
        'Внуково': '#32CD32',
        'Внуковское': '#40E0D0',
        'Войковский': '#4682B4',
        'Вороновское': '#483D8B',
        'Воскресенское': '#48D1CC',
        'Восточное Дегунино': '#4B0082',
        'Восточное Измайлово': '#556B2F',
        'Восточный': '#5F9EA0',
        'Выхино-Жулебино': '#6A5ACD',
        'Гагаринский': '#708090',
        'Головинский': '#778899',
        'Гольяново': '#7B68EE',
        'Даниловский': '#7CFC00',
        'Десёновское': '#7FFF00',
        'Дмитровский': '#7FFFD4',
        'Донской': '#800000',
        'Дорогомилово': '#800080',
        'Замоскворечье': '#808000',
        'Западное Дегунино': '#808080',
        'Зюзино': '#87CEFA',
        'Зябликово': '#8B0000',
        'Ивановское': '#8B008B',
        'Измайлово': '#8FBC8F',
        'Капотня': '#90EE90',
        'Киевский': '#9370D8',
        'Клёновское': '#98FB98',
        'Кокошкино': '#9932CC',
        'Коньково': '#9ACD32',
        'Коптево': '#A0522D',
        'Косино-Ухтомский': '#A52A2A',
        'Котловка': '#A9A9A9',
        'Краснопахорское': '#ADD8E6',
        'Красносельский': '#ADFF2F',
        'Крылатское': '#AFEEEE',
        'Крюково': '#B0C4DE',
        'Кузьминки': '#B0E0E6',
        'Кунцево': '#B22222',
        'Куркино': '#C71585',
        'Левобережный': '#CD5C5C',
        'Лефортово': '#CD853F',
        'Лианозово': '#D2691E',
        'Ломоносовский': '#D2B48C',
        'Лосиноостровский': '#D3D3D3',
        'Люблино': '#D87093',
        'Марушкинское': '#DA70D6',
        'Марфино': '#DAA520',
        'Марьина роща': '#DC143C',
        'Марьино': '#DCDCDC',
        'Матушкино': '#DEB887',
        'Метрогородок': '#E0FFFF',
        'Мещанский': '#E9967A',
        'Митино': '#EE82EE',
        'Михайлово-Ярцевское': '#EEE8AA',
        'Можайский': '#F08080',
        'Молжаниновский': '#F0E68C',
        'Москворечье-Сабурово': '#F0FFF0',
        'Московский': '#F0FFFF',
        'Нагатино-Садовники': '#F4A460',
        'Нагатинский затон': '#F5DEB3',
        'Нагорный': '#F5F5F5',
        'Некрасовка': '#FA8072',
        'Нижегородский': '#FF0000',
        'Новогиреево': '#FF00FF',
        'Новокосино': '#FF00FF',
        'Ново-Переделкино': '#FF1493',
        'Новофёдоровское': '#FF4500',
        'Обручевский': '#FF6347',
        'Орехово-Борисово Северное': '#FF69B4',
        'Орехово-Борисово Южное': '#FF7F50',
        'Останкинский': '#FFA07A',
        'Отрадное': '#FFA500',
        'Очаково-Матвеевское': '#FFB6C1',
        'Первомайское': '#FFC0CB',
        'Перово': '#FFD700',
        'Печатники': '#FFDAB9',
        'Покровское-Стрешнево': '#FFFF00',
        'Преображенское': '#0000CD',
        'Пресненский': '#0000FF',
        'Проспект Вернадского': '#006400',
        'Раменки': '#008080',
        'Роговское': '#008B8B',
        'Ростокино': '#00BFFF',
        'Рязановское': '#00CED1',
        'Рязанский': '#00FA9A',
        'Савелки': '#00FF7F',
        'Савёловский': '#00FFFF',
        'Свиблово': '#00FFFF',
        'Северное Бутово': '#191970',
        'Северное Измайлово': '#20B2AA',
        'Северное Медведково': '#2E8B57',
        'Северное Тушино': '#2F4F4F',
        'Северный': '#32CD32',
        'Силино': '#3CB371',
        'Сокол': '#40E0D0',
        'Соколиная гора': '#4682B4',
        'Сокольники': '#483D8B',
        'Солнцево': '#48D1CC',
        'Сосенское': '#4B0082',
        'Старое Крюково': '#556B2F',
        'Строгино': '#5F9EA0',
        'Таганский': '#6495ED',
        'Тверской': '#66CDAA',
        'Текстильщики': '#696969',
        'Теплый Стан': '#6A5ACD',
        'Тимирязевский': '#6B8E23',
        'Троицк': '#708090',
        'Тропарево-Никулино': '#778899',
        'Филевский парк': '#7CFC00',
        'Фили-Давыдково': '#7FFF00',
        'Филимонковское': '#800000',
        'Хамовники': '#800080',
        'Ховрино': '#808000',
        'Хорошево-Мневники': '#808080',
        'Хорошевский': '#87CEEB',
        'Царицыно': '#87CEFA',
        'Черемушки': '#8B0000',
        'Чертаново Северное': '#8B008B',
        'Чертаново Центральное': '#8B4513',
        'Чертаново Южное': '#8FBC8F',
        'Щаповское': '#90EE90',
        'Щербинка': '#9370D8',
        'Щукино': '#9400D3',
        'Южное Бутово': '#9932CC',
        'Южное Медведково': '#9ACD32',
        'Южное Тушино': '#A0522D',
        'Южнопортовый': '#A52A2A',
        'Якиманка': '#A9A9A9',
        'Ярославский': '#ADD8E6',
        'Ясенево': '#ADFF2F'

    };

    $.extend(UIK.regions, {
        init: function () {
            this.getData();
        },


        getData: function () {
            var that = this;

            $.ajax({
                dataType: "json",
                url: document['url_root'] + 'static/data/mos-mo-splitted.json',
                success: function (data) {
                    that.buildLayer(data);
                },
                error: function (data, status, error) {
                    alert(data, status, error);
                }
            });
        },


        buildLayer: function (data) {
            L.geoJson(data, {
                style: function (feature) {
                    return {
                        color: UIK.regions.colorMap[feature.properties.NAME],
                        "weight": 2
                    };
                },
                onEachFeature: function (feature, layer) {
                    var popupContent = 'Название: ' + feature.properties.NAME +
                        '</br>OKATO: ' + feature.properties['OKATO'] +
                        '</br>OKTMO: ' + feature.properties['OKTMO'];
                    layer.bindPopup(popupContent);
                }
            }).addTo(UIK.viewmodel.map);
        }
    });
})(jQuery, UIK);

